# PipeFittingAndAccessoryData Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PipeFittingAndAccessoryData Properties
PipeFittingAndAccessoryData Class See Also
---
The PipeFittingAndAccessoryData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BehaviorType | The behavior type of the pipe fitting or pipe accessory. |
| FluidDensity | The fluid density of the pipe fitting or pipe accessory, Units: (kg/ft³). |
| FluidViscosity | The fluid dynamic viscosity of the pipe fitting or pipe accessory, Units: (kg/(ft·s)). |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Origin | The origin position of the pipe fitting or pipe accessory. |
| PartType | The part type of the pipe fitting or pipe accessory. |
| ServerGUID | The GUID of the pipe fitting or pipe accessory. |
| SystemClassification | The system classification of the pipe fitting or pipe accessory. |

# See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace